Revit 2026 API

# DirectShapeReferenceOptions Properties

---

The DirectShapeReferenceOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name associated with the reference object. The name does not need to be unique. The name must not be empty and must contain valid characters. |

#### Reference

DirectShapeReferenceOptions Class

Autodesk.Revit.DB Namespace